#### SystemsAnalysisOptions Members

---

|  |
| --- |
| SystemsAnalysisOptions Class   Constructors   Methods   Properties   See Also |

The  SystemsAnalysisOptions  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | SystemsAnalysisOptions | Constructs a new instance of the options. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  SystemsAnalysisOptions |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | OutputFolder | The path of the output folder for systems analysis. |
| Public property | WeatherFile | The file name of the EnergyPlus weather (\*.epw). |
| Public property | WorkflowFile | The file name of the EnergyPlus workflow script. |

# See Also

SystemsAnalysisOptions Class

Autodesk.Revit.DB.Analysis Namespace